app/views/devise/registrations/edit.html.erb

	    <div><%= f.label :school %><br />
	    <%= collection_select(:user, :school_id, School.order("lower(name)"), :id, :name, :include_blank=> true, :class=>"input-small")  %></div>
---
SELECT "schools".* FROM "schools" ORDER BY lower(name)