app/views/timelogs/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user %><br />
	<%= collection_select(:timelog, :user_id, User.all, :id, :full_name)%>