app/views/timelogs/student.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
	<hr />
	<%student=User.find_by_id(params[:user_id])%>