app/views/users/edit.html.erb

SELECT "schools".* FROM "schools" ORDER BY lower(name)
---
		    <div><%= f.label "#{Constants::SCHOOL_NAME_REPLACEMENT}" %><br />
		    	<%= collection_select(:user, :school_id, School.order("lower(name)"), :id, :name, :include_blank=> true, :class=>"input-small")  %>

SELECT 1 AS one FROM "users" WHERE ("users"."userid" = '6006499934354304528' AND "users"."id" != 1) LIMIT 1
---
					<div>
				  		<%= check_box_tag "user[form_ids][]", form.id, @user.forms.include?(form) %>