app/views/users/new.html.erb

SELECT "schools".* FROM "schools" ORDER BY lower(name)
---
		    <div><%= f.label :school %><br />
		    <%= collection_select(:user, :school_id, School.order("lower(name)"), :id, :name, :include_blank=> true, :class=>"input-small")  %></div>