app/views/users/view.html.erb

SELECT "timelogs".* FROM "timelogs" WHERE "timelogs"."user_id" = 1 ORDER BY timein asc
---
		<tbody>
			<%@user.timelogs.where("timein >= ?", ApplicationHelper.getStartDate).order("timein DESC").each do |log|%>