app/controllers/schools_controller.rb

  def show
    @school = School.find(params[:id])
---
SELECT "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save
---
INSERT INTO "schools" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 13 Sep 2013 16:15:51 EDT -04:00], ["name", "NCSSM"], ["updated_at", Fri, 13 Sep 2013 16:15:51 EDT -04:00]]