app/controllers/timelogs_controller.rb

SELECT "timelogs".* FROM "timelogs" WHERE (timein >= '2013-08-31 00:00:00.000000' AND timeout_timestamp IS NULL)
---
  def index
    @timelogs = Timelog.page(params[:page]).per(500)

SELECT "timelogs".* FROM "timelogs" WHERE "timelogs"."id" = ? LIMIT 1  [["id", "student"]]
---
  def show
    @timelog = Timelog.find(params[:id])

SELECT "timelogs".* FROM "timelogs" WHERE "timelogs"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @timelog = Timelog.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."userid" = '6006499934354304528' LIMIT 1
UPDATE "timelogs" SET "timeout" = '2013-09-13 23:53:38.703709', "updated_at" = '2013-09-13 23:53:38.703811', "time_logged" = 33 WHERE "timelogs"."id" = 6
INSERT INTO "timelogs" ("created_at", "owner_id", "timein", "timeout_timestamp", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 30 Aug 2013 21:14:16 UTC +00:00], ["owner_id", nil], ["timein", nil], ["timeout_timestamp", nil], ["updated_at", Fri, 30 Aug 2013 21:14:16 UTC +00:00]]
---
  def create
    if params[:multi]
      student = User.find_by_userid(params[:owner_userid].downcase)
      if student.nil?
        redirect_to studentlogin_path, alert: "No Student Exists with this ID"
      elsif student.signed_in
        timelog = student.signed_in
        timelog.timeout = Time.now
        timelog.updated_at = Time.now
        if timelog.save

SELECT "timelogs".* FROM "timelogs" WHERE "timelogs"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "timelogs" SET "timein" = '2013-08-31 13:03:00.000000', "timeout" = '2013-08-31 18:08:00.000000', "time_logged" = 18300 WHERE "timelogs"."id" = 2
---
  def update
    @timelog = Timelog.find(params[:id])

    @timelog.updated_at = Time.now

SELECT "timelogs".* FROM "timelogs" WHERE "timelogs"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "timelogs" WHERE "timelogs"."id" = ?  [["id", 1]]
---
  def destroy
    @timelog = Timelog.find(params[:id])
    @timelog.destroy

SELECT "timelogs".* FROM "timelogs" WHERE (updated_at >= '2013-09-13 04:00:00.000000' ) ORDER BY updated_at DESC
---
  def student
    @timelog = Timelog.new
    @logs = Timelog.today.all