app/controllers/users_controller.rb

  def remove
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "encrypted_password" = '$2a$10$LW9KILsewlbqYBuB3VGm1er1KMGwGmwa4BXBZIYFiTOJ9MIlLVf2W', "tools" = 't', "conduct" = 'f', "updated_at" = '2013-09-13 22:42:11.694787' WHERE "users"."id" = 1

  def create
    @user = User.new(user_params)

    if(User.all.count<1)
      @user.admin = true
    end

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("admin", "conduct", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "name_first", "name_last", "phone", "remember_created_at", "reset_password_sent_at", "reset_password_token", "school_id", "sign_in_count", "tools", "updated_at", "userid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)